clear
clc

k = 2310; % 弹簧的弹性模量（N/m）
c = 13000; % 液压油的粘性摩擦系数（Ns/m）
m = 5; % 活塞与滚动膜片的质量（kg）
K = 1034.25e6; % 液压油的体积模量（Pa）
V_o =  3e-3; % 关节与压力补偿器内部液压油的初始体积（m^3）
x0 = 0.32; % 弹簧的预压缩量（m）
S_r = 0.035; % 滚动膜片的有效作用面积（m^2）
alpha = 9.5e-4; % 体积膨胀系数 （1/℃）

syms s
A = s^2 + c*s/m + k/m + S_r^2*K/(V_o*m); % 中间变量
Pw = 8e3/s^2; % 外界压强拉氏变换
T = 25/s - 1.84e-2/s^2; % 温度拉氏变换

Pj = (S_r^2*K/(V_o*m))*Pw/A + alpha*K*(s^2 + c*s/m + k/m)*T/A - ((m*9.8 - k*x0)*S_r*K/(m*V_o))/(A*s); % 关节内部压强拉氏变换
pj = ilaplace(Pj);

t = 1:1250;
% t = 1250;
f = (1133639249409974930752.*t)/141707432899379225 + (1577150804626032509586732262635711831515.*exp(-1300.*t).*(cos((5554883335815169^(1/2).*t)/8192) + (419900287022600369423786782462775185915863609344.*5554883335815169^(1/2).*sin((5554883335815169^(1/2).*t)/8192))/219022218067115833473194126940731644513637297012731275875))/64259188924582609749386849157122 + 637883161822319289611134978591047680/32129594462291304874693424578561;
plot(t,f);

t = 1250;
pj = 8000*t + 2.45e7*exp(-1300*t)*(cos(9098*t)+0.1429*sin(9098*t))+1.98e4;


% syms s k c m B V_o x0 S_r alpha v g T0 T1
% A = s^2 + c*s/m + k/m + S_r^2*B/(V_o*m);
% Pw = 10^4*v/s^2;
% T = T0/s - (T0 - T1)*v/(1000*s^2);
% Pc = (S_r^2*B/(V_o*m))*Pw/A + alpha*B*(s^2 + c*s/m + k/m)*T/A - ((m*g - k*x0)*S_r*B/(m*V_o))/(A*s);
% pc = ilaplace(Pc);
% 
% (1000*B^2*S_r^3*k*x0 - 1000*B^2*S_r^3*g*m - 10000000*B*S_r^2*V_o*c*v + 1000*B*S_r*V_o*k^2*x0 + 1000*B*T0*V_o^2*alpha*k^2 + 1000*B^2*S_r^2*T0*V_o*alpha*k - 1000*B*S_r*V_o*g*k*m - B^2*S_r^2*T0*V_o*alpha*c*v + B^2*S_r^2*T1*V_o*alpha*c*v)/(1000*(B*S_r^2 + V_o*k)^2) + (t*(10000000*B*v*S_r^2 - B*T0*V_o*alpha*k*v + B*T1*V_o*alpha*k*v))/(1000*B*S_r^2 + 1000*V_o*k) + (exp(-(c*t)/(2*m))*(cosh((t*(- B*m*S_r^2 + (V_o*c^2)/4 - V_o*k*m)^(1/2))/(V_o^(1/2)*m)) + (V_o^(1/2)*m*sinh((t*(- B*m*S_r^2 + (V_o*c^2)/4 - V_o*k*m)^(1/2))/(V_o^(1/2)*m))*((10000000*B*S_r^2*V_o^2*c^2*v - 10000000*B^2*S_r^4*V_o*m*v + 1000*B^3*S_r^4*T0*V_o*alpha*c + 1000*B^2*S_r^3*V_o*c*g*m - 1000*B*S_r*V_o^2*c*k^2*x0 - 1000*B^2*S_r^3*V_o*c*k*x0 - 10000000*B*S_r^2*V_o^2*k*m*v + 1000*B*S_r*V_o^2*c*g*k*m + B^2*S_r^2*T0*V_o^2*alpha*c^2*v - B^2*S_r^2*T1*V_o^2*alpha*c^2*v - B^3*S_r^4*T0*V_o*alpha*m*v + B^3*S_r^4*T1*V_o*alpha*m*v + 1000*B^2*S_r^2*T0*V_o^2*alpha*c*k - B^2*S_r^2*T0*V_o^2*alpha*k*m*v + B^2*S_r^2*T1*V_o^2*alpha*k*m*v)/(1000*B^2*S_r^3*V_o*g*m^2 + 1000*B^3*S_r^4*T0*V_o*alpha*m + 1000*B*S_r*V_o^2*g*k*m^2 + 10000000*B*S_r^2*V_o^2*c*m*v - 1000*B*S_r*V_o^2*k^2*m*x0 - 1000*B^2*S_r^3*V_o*k*m*x0 + 1000*B^2*S_r^2*T0*V_o^2*alpha*k*m + B^2*S_r^2*T0*V_o^2*alpha*c*m*v - B^2*S_r^2*T1*V_o^2*alpha*c*m*v) - c/(2*m)))/(- B*m*S_r^2 + (V_o*c^2)/4 - V_o*k*m)^(1/2))*(1000*B^2*S_r^3*V_o*g*m^2 + 1000*B^3*S_r^4*T0*V_o*alpha*m + 1000*B*S_r*V_o^2*g*k*m^2 + 10000000*B*S_r^2*V_o^2*c*m*v - 1000*B*S_r*V_o^2*k^2*m*x0 - 1000*B^2*S_r^3*V_o*k*m*x0 + 1000*B^2*S_r^2*T0*V_o^2*alpha*k*m + B^2*S_r^2*T0*V_o^2*alpha*c*m*v - B^2*S_r^2*T1*V_o^2*alpha*c*m*v))/(1000*V_o*m*(B*S_r^2 + V_o*k)^2)
